УТ_для_edt.РасширениеСмарт/src/Documents/РасходныйОрдерНаТовары/РасходныйОрдерНаТовары.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>РасходныйОрдерНаТовары</name>
  <objectBelonging>Adopted</objectBelonging>
  <registerRecords>AccumulationRegister.смартОстаткиНаСкладеГарантийныхЗапчастей</registerRecords>
  <attributes>
    <name>СкладскаяОперация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>РежимПросмотраПоТоварам</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Получатель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПорядокДоставки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ДатаОтгрузки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Статус</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Помещение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ЗонаОтгрузки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Приоритет</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Контролер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ЗаданиеНаПеревозку</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВсегоМест</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <tabularSections>
    <name>ОтгружаемыеТовары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Назначение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Серия</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Действие</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>УпаковочныйЛист</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>СтатусУказанияСерий</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>2</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>УпаковочныйЛистРодитель</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТоварыПоРаспоряжениям</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>Серия</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Назначение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Распоряжение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>СтатусУказанияСерий</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>2</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
</mdclass:Document>

УТ_для_edt.РасширениеСмарт/src/AccumulationRegisters/ТоварыКОтгрузке/ТоварыКОтгрузке.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ТоварыКОтгрузке</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <registerType>Checked</registerType>
  </extension>
  <resources>
    <name>КОтгрузке</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources>
    <name>ВРезерве</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources>
    <name>КОформлению</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources>
    <name>КСборке</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources>
    <name>Собирается</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources>
    <name>Собрано</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <attributes>
    <name>ЗаданиеНаПеревозку</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <dimensions>
    <name>ДокументОтгрузки</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>Получатель</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>Назначение</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>Серия</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:AccumulationRegister>

УТ_для_edt.РасширениеСмарт/src/AccumulationRegisters/ТоварыНаСкладах/ТоварыНаСкладах.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ТоварыНаСкладах</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <registerType>Checked</registerType>
  </extension>
  <resources>
    <name>ВНаличии</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>Серия</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:AccumulationRegister>

УТ_для_edt.РасширениеСмарт/src/Documents/РасходныйОрдерНаТовары/ObjectModule.bsl
#Область ДоработкиСмарт

#КонецОбласти

#Область ПеренесеноСДоработкамиСмарт

//++ #1480 смарт: Ермаков 04.10.2023 //Чистка старых данных для корректности работы отчета Контроль сдачи на склад снятых З/Ч  
&ИзменениеИКонтроль("ОбработкаПроведения")
Процедура смарт_ОбработкаПроведения(Отказ, РежимПроведения)

	ПроведениеСерверУТ.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства, РежимПроведения);

	Документы.РасходныйОрдерНаТовары.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);

	ПроведениеСерверУТ.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);

	ЗапасыСервер.ОтразитьТоварыНаСкладах(ДополнительныеСвойства, Движения, Отказ);
	ЗаказыСервер.ОтразитьТоварыКОтгрузке(ДополнительныеСвойства, Движения, Отказ);
	СкладыСервер.ОтразитьТоварыКОтбору(ДополнительныеСвойства, Движения, Отказ);
	СкладыСервер.ОтразитьДвиженияСерийТоваров(ДополнительныеСвойства, Движения, Отказ);
	СкладыСервер.ОтразитьТоварыВЯчейках(ДополнительныеСвойства, Движения, Отказ);

	#Вставка
	//++ #1480 смарт: Ермаков 04.10.2023 //Чистка старых данных для корректности работы отчета Контроль сдачи на склад снятых З/Ч  
	смартСервер.ОтразитьДвиженияГарантийныхЗапасныхЧастей(ДополнительныеСвойства, Движения, Отказ);
	//-- #1480 смарт: Ермаков 04.10.2023 //Чистка старых данных для корректности работы отчета Контроль сдачи на склад снятых З/Ч  
	#КонецВставки
	
	СформироватьСписокРегистровДляКонтроля();

	ПроведениеСерверУТ.ЗаписатьНаборыЗаписей(ЭтотОбъект);

	ПроведениеСерверУТ.ВыполнитьКонтрольРезультатовПроведения(ЭтотОбъект, Отказ);
	ПроведениеСерверУТ.ЗаписатьПодчиненныеНаборамЗаписейДанные(ЭтотОбъект, Отказ);

	РегистрыСведений.СостоянияЗаказовКлиентов.ОтразитьСостояниеЗаказа(ЭтотОбъект, Отказ);

	ПроведениеСерверУТ.ОчиститьДополнительныеСвойстваДляПроведения(ДополнительныеСвойства);

    #Вставка
	//++ #1480 смарт: Ермаков (Фролов) 04.10.2023 //Чистка старых данных для корректности работы отчета Контроль сдачи на склад снятых З/Ч  
	Если Не Отказ И ДополнительныеСвойства.ЭтоНовый Тогда 
		Документы.ЗаказКлиента.СнятьСогласованиеБухВЧастичноОтгруженныхЗаказах(ЭтотОбъект.ТоварыПоРаспоряжениям.ВыгрузитьКолонку("Распоряжение"),
		"Согласование БУХ снято при отгрузке по " + ЭтотОбъект);
	КонецЕсли;	
	//-- #1480 смарт: Ермаков 04.10.2023 //Чистка старых данных для корректности работы отчета Контроль сдачи на склад снятых З/Ч  
	#КонецВставки

КонецПроцедуры
//-- #1480 смарт: Ермаков 04.10.2023 //Чистка старых данных для корректности работы отчета Контроль сдачи на склад снятых З/Ч  

//++ #1480 смарт: Ермаков 04.10.2023 //Чистка старых данных для корректности работы отчета Контроль сдачи на склад снятых З/Ч  
&ИзменениеИКонтроль("СформироватьСписокРегистровДляКонтроля")
Процедура смарт_СформироватьСписокРегистровДляКонтроля()

	Массив = Новый Массив;

	Если Не ДополнительныеСвойства.Свойство("ОтключитьКонтрольПриПроведении") Тогда
		Если ДополнительныеСвойства.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
			Массив.Добавить(Движения.ТоварыКОтгрузке);
			Движения.ТоварыКОтгрузке.ДополнительныеСвойства.Вставить("ЗапретитьКонтрольДвиженияТоварыКОтгрузкеИзменениеСводно", Истина);
			Если Статус = Перечисления.СтатусыРасходныхОрдеров.КОтбору
				Или Статус = Перечисления.СтатусыРасходныхОрдеров.Подготовлено Тогда
				Массив.Добавить(Движения.ТоварыНаСкладах);
			КонецЕсли;
		КонецЕсли;

		Если СкладыСервер.ИспользоватьАдресноеХранение(Склад, Помещение, ДатаОтгрузки) Тогда

			Массив.Добавить(Движения.ТоварыКОтбору);

		КонецЕсли;
		
		#Вставка 
		//++ #1480 смарт: Ермаков 04.10.2023 //Чистка старых данных для корректности работы отчета Контроль сдачи на склад снятых З/Ч  
		Массив.Добавить(Движения.смартДвиженияГарантийныхЗапасныхЧастей);
		//-- #1480 смарт: Ермаков 04.10.2023 //Чистка старых данных для корректности работы отчета Контроль сдачи на склад снятых З/Ч  
		#КонецВставки
		
	КонецЕсли;

	ДополнительныеСвойства.ДляПроведения.Вставить("РегистрыДляКонтроля", Массив);

КонецПроцедуры

&ИзменениеИКонтроль("ПередЗаписью")
Процедура смарт_ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	#Вставка
	//++ #Б968 смарт: Шляпников 15.11.2024 / Рефакторинг кода 1С. База УТ СМАРТ. Документы. РасходныйОрдерНаТовары
	// Фролов+
	Если ЭтоНовый() Тогда 
		ТабРаспоряжений=ЭтотОбъект.ТоварыПоРаспоряжениям.Выгрузить(,"Распоряжение");
		ТабРаспоряжений.Свернуть("Распоряжение");
		Для Каждого Стр Из ТабРаспоряжений Цикл 
			Если ТипЗнч(Стр.Распоряжение)=Тип("ДокументСсылка.ЗаказКлиента") И Не Стр.Распоряжение.СогласованоБух Тогда 
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В заказе "+Стр.Распоряжение+" не проставлена галочка 'Согласовано Фин.'. Обратитесь в бухгалтерию.",,,,Отказ);
			КонецЕсли;	
		КонецЦикла;	
	КонецЕсли;	
	// Фролов-
	#КонецВставки
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	
	#Удаление //++ #Б968 смарт: Шляпников 15.11.2024 / Рефакторинг кода 1С. База УТ СМАРТ. Документы. РасходныйОрдерНаТовары
	Если НЕ ПраваПользователяПовтИсп.ВзятиеРасходногоОрдераВРаботу() Тогда
	#КонецУдаления
	
	#Вставка
	//++ #Б968 смарт: Шляпников 15.11.2024 / Рефакторинг кода 1С. База УТ СМАРТ. Документы. РасходныйОрдерНаТовары
	//++ смарт:ММ #077 380 26.10.2020 - Обработка для комплектации номенклатуры
	ПроверятьНаличиеРолиВзятиеРасходногоОрдераВРаботу = Истина;
	ДополнительныеСвойства.Свойство("смартПроверятьНаличиеРолиВзятиеРасходногоОрдераВРаботу", ПроверятьНаличиеРолиВзятиеРасходногоОрдераВРаботу);

	Если НЕ ПраваПользователяПовтИсп.ВзятиеРасходногоОрдераВРаботу() 
		И ПроверятьНаличиеРолиВзятиеРасходногоОрдераВРаботу <> Ложь Тогда
		//-- смарт:ММ 26.10.2020
	//-- #Б968 смарт: Шляпников 15.11.2024
	#КонецВставки
		
		Если  Статус <> Перечисления.СтатусыРасходныхОрдеров.Подготовлено
			И РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
			
			ВызватьИсключение НСтр("ru = 'Недостаточно прав на взятие расходного ордера в работу.'");
			
		КонецЕсли;
		
		СтарыйСтатус = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "Статус");
		
		Если СтарыйСтатус <> Перечисления.СтатусыРасходныхОрдеров.Подготовлено
			И СтарыйСтатус <> Неопределено Тогда
			
			ВызватьИсключение НСтр("ru = 'Недостаточно прав на изменение статуса расходного ордера, взятого в работу.'");
			
		КонецЕсли;
		
	КонецЕсли;

	ПроведениеСерверУТ.УстановитьРежимПроведения(ЭтотОбъект, РежимЗаписи, РежимПроведения);

	ДополнительныеСвойства.Вставить("ЭтоНовый",    ЭтоНовый());
	ДополнительныеСвойства.Вставить("РежимЗаписи", РежимЗаписи);
	
	СформироватьСписокЗависимыхЗаказов();
	
	ПараметрыУказанияСерий = НоменклатураСервер.ПараметрыУказанияСерий(ЭтотОбъект, Документы.РасходныйОрдерНаТовары);
	
	НоменклатураСервер.ОчиститьНеиспользуемыеСерии(ЭтотОбъект, ПараметрыУказанияСерий.ТоварыПоРаспоряжениям);
	НоменклатураСервер.ОчиститьНеиспользуемыеСерии(ЭтотОбъект, ПараметрыУказанияСерий.ОтгружаемыеТовары);
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьСтатусыРасходныхОрдеров", Новый Структура("Склад", Склад)) Тогда
		Статус = Перечисления.СтатусыРасходныхОрдеров.Отгружен;
	КонецЕсли;
	
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		ПроверитьОрдерныйСклад(Отказ);
	КонецЕсли;
	
	ВсегоМест = УпаковочныеЛистыСервер.КоличествоМестВТЧ(ОтгружаемыеТовары);
	
КонецПроцедуры

&ИзменениеИКонтроль("ОбработкаЗаполнения")
Процедура смарт_ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	Перем Отказ;

	Если ДанныеЗаполнения = "АвтоТест" Тогда
		Возврат;
	КонецЕсли;	

	#Вставка
	//++ #Б968 смарт: Шляпников 15.11.2024 / Рефакторинг кода 1С. База УТ СМАРТ. Документы. РасходныйОрдерНаТовары
	//Каратеев ++
	Если ЗначениеЗаполнено(ДанныеЗаполнения) Тогда
		
		Если ТипЗнч(ДанныеЗаполнения) <> Тип("Строка") Тогда	
			Распоряжение = ДанныеЗаполнения;
		КонецЕсли;
		
		Если ТипЗнч(Распоряжение) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Или ТипЗнч(Распоряжение) = Тип("ДокументСсылка.ЗаказКлиента") Тогда
			
			ЗаказКлиента = Распоряжение.ЗаказКлиента.ПолучитьОбъект();
			
			Если Распоряжение.ЗаказКлиента = Неопределено Тогда
				ТекстОшибки = "Отгурзка по реализациям без Заказа клиента запрещена! 
				|Если вам каким то образом удалось создать создать Реализацию без Заказа клиента, обратитесь к Администратору";
				ВызватьИсключение ТекстОшибки;
			ИначеЕсли Не Распоряжение.ЗаказКлиента.СогласованоБух Тогда
				ТекстОшибки = "Отгрузка возможна только после согласования Заказа клиента! 
				|Обратитесь в бухгалтерию "+Распоряжение.ЗаказКлиента.Организация+" для установки ""Согласовано фин. отделом""";
				ВызватьИсключение ТекстОшибки;
			КонецЕсли;
			
			Документы.РасходныйОрдерНаТовары.СнятьПризнакСогласованоФинЗаказа(ЗаказКлиента);
			
		КонецЕсли; 
	КонецЕсли;
	//Каратеев --
	//-- #Б968 смарт: Шляпников 15.11.2024
	#КонецВставки

	Если Не (ЗначениеЗаполнено(Склад)
		И ЗначениеЗаполнено(СкладскаяОперация)
		И (ЗначениеЗаполнено(Получатель) Или СкладскаяОперация = Перечисления.СкладскиеОперации.ОтгрузкаНаВнутренниеНужды)
		И ЗначениеЗаполнено(ДатаОтгрузки)) Тогда

		Отказ = Истина;

	Иначе

		ИспользоватьПомещения = СкладыСервер.ИспользоватьСкладскиеПомещения(Склад, ДатаОтгрузки, Истина);

		Если ИспользоватьПомещения
			И Не ЗначениеЗаполнено(Помещение) Тогда
			Отказ = Истина;
		КонецЕсли;

	КонецЕсли;

	Если Отказ = Истина Тогда
		ТекстСообщения = НСтр("ru='Расходный ордер на товары можно вводить только на основании распоряжения на отгрузку товаров.'");
		ВызватьИсключение ТекстСообщения;
	КонецЕсли;

	ИнициализироватьДокумент(ДанныеЗаполнения);

	ПараметрыУказанияСерий = Документы.РасходныйОрдерНаТовары.ПараметрыУказанияСерий(ЭтотОбъект);

	НоменклатураСервер.ЗаполнитьСтатусыУказанияСерий(ЭтотОбъект, ПараметрыУказанияСерий.ТоварыПоРаспоряжениям); 

	Документы.РасходныйОрдерНаТовары.ЗаполнитьОтгружаемыеТоварыПоТоварамПоРаспоряжениям(ЭтотОбъект);

	Документы.РасходныйОрдерНаТовары.ЗаполнитьДействиеВСтроках(ЭтотОбъект);

	НоменклатураСервер.ЗаполнитьСерииПоFEFO(ЭтотОбъект, ПараметрыУказанияСерий.ОтгружаемыеТовары, Ложь); 

	Если Не СкладыСервер.ИспользоватьАдресноеХранение(Склад, Помещение, ДатаОтгрузки)
		И ПолучитьФункциональнуюОпцию("ИспользоватьУпаковкиНоменклатуры") Тогда
		Документы.РасходныйОрдерНаТовары.РазбитьПоУпаковкамСправочно(ЭтотОбъект);
	КонецЕсли;

	НоменклатураСервер.ЗаполнитьСтатусыУказанияСерий(ЭтотОбъект, ПараметрыУказанияСерий.ОтгружаемыеТовары); 

КонецПроцедуры
//-- #1480 смарт: Ермаков 04.10.2023 //Чистка старых данных для корректности работы отчета Контроль сдачи на склад снятых З/Ч  

#КонецОбласти
